БухЭксп/InformationRegisters/CW_ДокументыОтчетаЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДокументыОтчетаЭкспедитора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ДоговорыПоГрузоперевозкам</xr:Item>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_Заказы</xr:Item>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
				<xr:Item>Catalog.CW_ПриложенияКДоговорам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПодписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКолонтитулов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКолонтитулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныСтандартныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныСтандартныхПисем</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытаяКопия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаОтправкиДокументов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяФайлаПакета = "Пакет документов";
	
	Параметры.Свойство("АдресПараметровОповещения",		АдресПараметровОповещения);
	Параметры.Свойство("Получатели", 					Получатели);
	Параметры.Свойство("ПолучателиКопия", 				ПолучателиКопия);
	Параметры.Свойство("ПолучателиСкрытаяКопия", 		ПолучателиСкрытаяКопия);
	Параметры.Свойство("ШаблонПисьма", 					Шаблон);
	Параметры.Свойство("ДанныеДляЗаполненияШаблона", 	ДанныеДляЗаполненияШаблона);
	Параметры.Свойство("ПечатныеФормыПодготовлены", 	ПечатныеФормыПодготовлены);

	Элементы.Шаблон.Видимость 						= ЗначениеЗаполнено(ДанныеДляЗаполненияШаблона);
	Элементы.ДанныеДляЗаполненияШаблона.Видимость 	= ЗначениеЗаполнено(ДанныеДляЗаполненияШаблона);
	
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияШаблона) Тогда
		
		ИдентификаторОбъектаШаблона = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДанныеДляЗаполненияШаблона));
		
		ЕстьДоговор = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДляЗаполненияШаблона, "Договор");
		Если ЕстьДоговор Тогда
			
			Договор = ДанныеДляЗаполненияШаблона.Договор;
			Если ТипЗнч(Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
				ЗаполнитьШабонИПолучателейПоДоговору(Договор);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПечатныеФормыПодготовлены Тогда
		
		Если Параметры.Свойство("АдресТаблицыПечатныхФорм") Тогда
			Если ЭтоАдресВременногоХранилища(Параметры.АдресТаблицыПечатныхФорм) Тогда
				ТаблицаПечатныхФорм = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыПечатныхФорм);
				
				//идём по таблице, делаем доп. проверку и получаем табличные документы
				Для каждого СтрокаТаблицы Из ТаблицаПечатныхФорм Цикл
					
					// добавляем в обработку
					СтрокаФорм = Формы.Добавить();
					СтрокаФорм.Отправлять 	= Истина;
					СтрокаФорм.Имя 			= СтрокаТаблицы.Представление;
					
					ТабличныйДокумент 		= ПолучитьИзВременногоХранилища(СтрокаТаблицы.АдресТабДок);
					СтрокаФорм.Адрес 		= ПоместитьВоВременноеХранилище(ТабличныйДокумент, Новый УникальныйИдентификатор);
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ЗаполнитьДанныеПечатныхФормОбъекта(ДанныеДляЗаполненияШаблона);
		ДобавитьПечатныеФормыСвязанныхДокументов();
		
	КонецЕсли; 
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяШаблоныДокументов") Тогда
		ЗаполнитьСписокДоступныхШаблонов();
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеФайловогоАрхива") Тогда
		СформироватьДеревоФайлов();
	КонецЕсли;    
	
	ЭлементыДереваФайлов = ДеревоФайлов.ПолучитьЭлементы();
	Элементы.СтраницаФайлы.Видимость 				= ЭлементыДереваФайлов.Количество() > 0;
	Элементы.СтраницаШаблоныДокументов.Видимость 	= ШаблоныДокументов.Количество() > 0;
	Элементы.СтраницаПечатныеФормы.Видимость 		= Формы.Количество() > 0;

	//Подключаемые обработки отправки писем
	// дополнительные подключаемые обработки отправки писем
	// пока просто запомним, есть они у нас или нет
	Ответ = НайтиПодключаемыеОбработкиДляПисем();
	
	Список_Серверные.ЗагрузитьЗначения(Ответ.Массив_Серверные);
	Список_Интерактивные.ЗагрузитьЗначения(Ответ.Массив_Интерактивные);
	
	ЕстьПодключаемыеОбработкиДляПисем = Список_Интерактивные.Количество()<> 0
										ИЛИ Список_Серверные.Количество() <> 0;
	//Подключаемые обработки отправки писем
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПечатныеФормыСвязанныхДокументов()
	
	Если ТипЗнч(ДанныеДляЗаполненияШаблона)= Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		
		МассивСвязанныхДокументов =	ПолучитьМассивСвязанныхДокументов();
		Для Каждого ЭлементМассива из МассивСвязанныхДокументов Цикл
			ЗаполнитьДанныеПечатныхФормОбъекта(ЭлементМассива, ДанныеДляЗаполненияШаблона);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСвязанныхДокументов()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
	               |ИЗ
	               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
	               |ГДЕ
	               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
	               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СвязанныйДокумент УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ОтчетЭкспедитора", ДанныеДляЗаполненияШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока  Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.СвязанныйДокумент);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции 

&НаСервере
Процедура ЗаполнитьСписокДоступныхШаблонов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ШаблоныДокументов.Ссылка КАК Шаблон,
	               |	CW_ШаблоныДокументов.ИмяФормата КАК Формат
	               |ИЗ
	               |	Справочник.CW_ШаблоныДокументов КАК CW_ШаблоныДокументов
	               |ГДЕ
	               |	CW_ШаблоныДокументов.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ШаблоныДокументов.Владелец = &Владелец";   
	
	Запрос.УстановитьПараметр("Владелец", ДанныеДляЗаполненияШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ШаблоныДокументов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПечатныхФормОбъекта(ОбъектПечати, КонтекстВызова=Неопределено)
	
	СоответствиеСвойств = ПолучитьСоответствиеСвойстваВидуОбработки();
	
	ТаблицаПФ				= CW_Печать.ПолучитьПустуюТаблицуПечатныхФорм();
	МассивИменМетаданных	= CW_Печать.ПолучитьМассивИменМетеданных(ОбъектПечати);
	
	CW_Печать.ЗаполнитьТаблицуПечатныхФормОбъектов(МассивИменМетаданных, ТаблицаПФ);
	
	//идём по таблице, делаем доп. проверку и получаем табличные документы
	Для каждого ПФ Из ТаблицаПФ Цикл
		
		Попытка
			
			ТекущееСвойство = СоответствиеСвойств.Получить(ПФ.ВидОбработки);
			Если ТекущееСвойство = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Обработка = ПФ[ТекущееСвойство];
			
			СПФ = CW_Печать.ПолучитьПечатнуюФорму(ОбъектПечати,ПФ.ВидОбработки,Обработка,,,Истина,КонтекстВызова);
			
			Если СПФ.Использование Тогда
				
				// добавляем в обработку
				СтрокаФорм = Формы.Добавить();
				СтрокаФорм.Отправлять 	= Истина;
				СтрокаФорм.Имя 			= СПФ.Представление;
				СтрокаФорм.Адрес 		= ПоместитьВоВременноеХранилище(СПФ.ПечатнаяФорма, Новый УникальныйИдентификатор);
							
			КонецЕсли; 
			          		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки; 
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеСвойстваВидуОбработки()
	
	Результат = Новый Соответствие;
	Результат.Вставить("СтандартнаяВнешняя",	"ДвоичныеДанные");
	Результат.Вставить("Внешняя",				"СсылкаНаОбработку");
	Результат.Вставить("Внутренняя",			"ИмяОбработки");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШабонИПолучателейПоДоговору(Знач Договор)
	
	Если ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Если ДанныеДляЗаполненияШаблона.ФормируетсяАкт Тогда
			
			Если Не ЗначениеЗаполнено(Получатели) Тогда
				Получатели 	= Договор.ЭлектронныйАдресДляОтправкиАктов;
				Если Не ЗначениеЗаполнено(Получатели) тогда
					Получатели 	= Договор.ЭлектронныйАдресДляДокументов;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Шаблон) Тогда
				Шаблон 		= Договор.ШаблонПисьмаДляОтправкиАктов;
				Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
					Шаблон = Договор.ОсновнойШаблонПисьма;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
					Шаблон = Константы.CW_ШаблонПисьмаАкта.Получить();	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ДанныеДляЗаполненияШаблона.ФормируетсяСчет Тогда 
			
			Если Не ЗначениеЗаполнено(Получатели) Тогда
				Получатели 	= Договор.ЭлектронныйАдресДляОтправкиСчетов;
				Если Не ЗначениеЗаполнено(Получатели) тогда
					Получатели 	= Договор.ЭлектронныйАдресДляДокументов;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
				Шаблон 		= Договор.ШаблонПисьмаДляОтправкиСчетов;
				Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
					Шаблон = Договор.ОсновнойШаблонПисьма;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
					Шаблон = Константы.CW_ШаблонПисьмаСчета.Получить();	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
			Шаблон 		= Договор.ОсновнойШаблонПисьма;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Получатели) Тогда
			Получатели 	= Договор.ЭлектронныйАдресДляДокументов;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		
		Шаблон 		= Договор.ШаблонПисьмаДляОтправкиОтчетаЭкспедитора;
		Получатели 	= Договор.ЭлектронныйАдресДляОтправкиОтчетаЭкспедитора;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Отправить(Команда)
	
	СтруктураПолучателей = Новый Структура;
	СтруктураПолучателей.Вставить("Кому",			Получатели); 
	СтруктураПолучателей.Вставить("Копия",			ПолучателиКопия); 
	СтруктураПолучателей.Вставить("СкрытаяКопия",	ПолучателиСкрытаяКопия); 
	
	СтруктураПисьма = СформироватьПисьмо(СтруктураПолучателей);
	
	
	// по умолчанию - готовим структуру письма и показываем диалог письма
	ОткрыватьСтандартнуюФормуОтправкиПочты = Истина;
	
	СтруктураОтправки = Новый Структура("СтруктураПисьма");
	СтруктураОтправки.СтруктураПисьма = СтруктураПисьма;
	
	ДополнитьВСтруктуруСобытияДанныеОтправки(СтруктураОтправки);
	
	//Подключаемые обработки отправки писем
	// если есть подключаемая обработка для дополнительных действий подготовки письма
	Если ЕстьПодключаемыеОбработкиДляПисем Тогда 
		// если есть подключаемая обработка, то она может показать свой диалог, модифицировать структуру
		// а может и сама выполнить отправку, и тогда не понадобится делать этого стандартным способом
		ВыполнитьПодключаемыеОбработкиДляПисем(СтруктураОтправки);
	КонецЕсли;
	//Подключаемые обработки отправки писем
	
	Если ОткрыватьСтандартнуюФормуОтправкиПочты Тогда 
    	ОткрытьФорму("Обработка.CW_ОтправкаПочты.Форма.Форма", СтруктураОтправки);
	КонецЕсли;
	
    ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьВСтруктуруСобытияДанныеОтправки(СтруктураОтправки)
	
	Событие = Новый Структура("Контрагент,ОбъектСобытия", Неопределено, Неопределено);

	Если ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") или
		 ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")  Тогда
		 
		Событие.Вставить("Контрагент",  	ДанныеДляЗаполненияШаблона.Контрагент);
		Событие.Вставить("ОбъектСобытия",	ДанныеДляЗаполненияШаблона);
		
	КонецЕсли;
	
	СтруктураОтправки.Вставить("Событие", 	Событие);        

КонецПроцедуры

//Подключаемые обработки отправки писем
&НаСервереБезКонтекста
Функция НайтиПодключаемыеОбработкиДляПисем()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Массив_Интерактивные", Новый Массив);
	СтруктураОтвета.Вставить("Массив_Серверные", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст =		"ВЫБРАТЬ РАЗЛИЧНЫЕ
	              		|	CW_ПодключаемыеОбъекты.Ссылка КАК ПодключаемыйОбъектСсылка
	              		|ИЗ
	              		|	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	              		|ГДЕ
	              		|	CW_ПодключаемыеОбъекты.Вид = ""ОбработкаОтправляемыхПисем""
	              		|	И НЕ CW_ПодключаемыеОбъекты.ПометкаУдаления
	              		|	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбработкаОбъект = _ПО.ПолучитьОбработку(Выборка.ПодключаемыйОбъектСсылка);
		
		// определим, что умеет делать обработка
		ИнформацияОбработки = ОбработкаОбъект.Информация();
		
		Если ТипЗнч(ИнформацияОбработки.Формы)=Тип("Массив") Тогда 
			// есть формы, из них важна только ФормаОбработки - если есть, то е будем открывать
			Для Каждого СтруктураФормы Из ИнформацияОбработки.Формы Цикл
				Если СтруктураФормы.Тип = "ФормаОбработки" Тогда 
					// интерактивная обработка, откроет свою форму перед открытием стандартной
					СтруктураОтвета.Массив_Интерактивные.Добавить(Выборка.ПодключаемыйОбъектСсылка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(ИнформацияОбработки.Методы)=Тип("Массив")
			И ИнформацияОбработки.Методы.Найти("ОбработатьПараметрыФормыОтправкиПисьма") <> Неопределено
		Тогда 
			// есть метод неинтерактивной обработки, только изменение структуры письма до открытия интерактивной (возможна непосредственная отправка, тогда вместо) 
			СтруктураОтвета.Массив_Серверные.Добавить(Выборка.ПодключаемыйОбъектСсылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОтвета;
	
КонецФункции


&НаКлиенте
Процедура ВыполнитьПодключаемыеОбработкиДляПисем(СтруктураОтправки)
	
	Массив_Серверные = Список_Серверные.ВыгрузитьЗначения(); 
	// Если есть неинтерактивные обработки
	Если Массив_Серверные.Количество() > 0 Тогда 
		Ответ = ВыполнитьПодключаемыеОбработкиДляПисемНаСервере(СтруктураОтправки, Массив_Серверные);
		// если не надо будет открывать стандартную интерактивную форму
		
		Если Ответ.Свойство("ОткрыватьСтандартнуюФормуОтправкиПочты") Тогда
			ОткрыватьСтандартнуюФормуОтправкиПочты = Ответ.ОткрыватьСтандартнуюФормуОтправкиПочты;
		КонецЕсли;
	КонецЕсли;
	
	Массив_Интерактивные = Список_Интерактивные.ВыгрузитьЗначения();
	// Если есть интерактивные обработки
	Для Каждого ПодключаемыйОбъектСсылка Из Массив_Интерактивные Цикл
		// открываем форму
		ПолноеИмяФормы = ПолноеИмяФормыПодключаемогоОбъекта(ПодключаемыйОбъектСсылка);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыПодключаемойОбработкиПисьма",ЭтотОбъект);
		ОткрытьФорму(ПолноеИмяФормы, СтруктураОтправки,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолноеИмяФормыПодключаемогоОбъекта(ПодключаемыйОбъектСсылка)
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(ПодключаемыйОбъектСсылка);
	_ПолноеИмяФормы = _ПО.ПолучитьПолноеИмяФормыПоТипу(ПодключаемыйОбъектСсылка, "ФормаОбработки");
	
	Возврат _ПолноеИмяФормы;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыПодключаемойОбработкиПисьма(Ответ, ДополнительныеПараметры=Неопределено) Экспорт 
	
	Если Ответ=Неопределено Тогда
		// закрыли через "Закрыть"
		ОткрыватьСтандартнуюФормуОтправкиПочты= Ложь;
		
	Иначе 
		Если Ответ.Код = 0 Тогда 
			// ок
			Если Ответ.Свойство("ОткрыватьСтандартнуюФормуОтправкиПочты") Тогда
				ОткрыватьСтандартнуюФормуОтправкиПочты = Ответ.ОткрыватьСтандартнуюФормуОтправкиПочты;
			КонецЕсли;
			
		Иначе 
			_УФК.ВывестиПредупреждение("Ошибка : "+_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьПодключаемыеОбработкиДляПисемНаСервере(ПараметрыОтправкиПисьма, МассивСсылокНаПодключаемыеОбработки_Серверные)
	
	СтруктураОтвета = Новый Структура;
	
	// Если есть неинтерактивные обработки
	Если МассивСсылокНаПодключаемыеОбработки_Серверные.Количество()<> 0 Тогда 
		
		Для Каждого ПодключаемыйОбъектСсылка Из МассивСсылокНаПодключаемыеОбработки_Серверные Цикл
			
			ОбработкаОбъект = _ПО.ПолучитьОбработку(ПодключаемыйОбъектСсылка);
			ОбработкаОбъект.ПодключаемыйОбъект = ПодключаемыйОбъектСсылка;
			стру = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъектСсылка);
			Если ТипЗнч(стру) = Тип("Структура") Тогда 
				ЗаполнитьЗначенияСвойств(ОбработкаОбъект, стру);
			КонецЕсли;
			
			стру = ОбработкаОбъект.Информация();
			Если ТипЗнч(стру.Методы)=Тип("Массив")
				И НЕ Неопределено=стру.Методы.Найти("ОбработатьПараметрыФормыОтправкиПисьма")
				Тогда 
				Ответ = ОбработкаОбъект.ОбработатьПараметрыФормыОтправкиПисьма(ПараметрыОтправкиПисьма);
				Если Ответ.Свойство("ОткрыватьСтандартнуюФормуОтправкиПочты") Тогда 
					СтруктураОтвета.Вставить("ОткрыватьСтандартнуюФормуОтправкиПочты", Ответ.ОткрыватьСтандартнуюФормуОтправкиПочты);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат СтруктураОтвета;
	
КонецФункции
//Подключаемые обработки отправки писем

  

&НаСервере
Процедура СформироватьДеревоФайлов()
	
	Модуль_РаботаСФайлами = CW_РаботаСФайламиСервер.ПолучитьОбщийМодульРаботыСфайлами();

	МассивВладельцев = ПолучитьМассивВладельцевАрхива();
	
	тДеревоФайлов = РеквизитФормыВЗначение("ДеревоФайлов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Объект КАК Объект,
	               |	CW_ОбъектыАрхива.Ссылка КАК Файл,
	               |	CW_ОбъектыАрхива.Расширение КАК Расширение
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Объект В(&МассивВладельцев)
	               |	И CW_ОбъектыАрхива.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ОбъектыАрхива.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ОбъектыАрхива.СпособХраненияАрхива <> 1
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Объект
	               |ИТОГИ ПО
	               |	Объект
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МассивВладельцев", МассивВладельцев);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъекты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъекты.Следующий() Цикл
		
		ИдентификаторОбъектаМетаданных 	=  Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(ТипЗнч(ВыборкаОбъекты.Объект),Ложь);
		ПредставлениеГруппы 	= ИдентификаторОбъектаМетаданных.Синоним;
		
		Отбор = Новый Структура("Группа,Представление",Истина,ПредставлениеГруппы);
		
		ГруппаДерева = тДеревоФайлов.Строки.Найти(ПредставлениеГруппы, "Представление", Ложь);
		Если ГруппаДерева = Неопределено Тогда
			ГруппаДерева = тДеревоФайлов.Строки.Добавить();
			ГруппаДерева.Группа 		= Истина;
			ГруппаДерева.Представление 	= ПредставлениеГруппы;
			ГруппаДерева.ИндексКартинки = 2;
		КонецЕсли;
		
		ЕстьРеквизитПредставлениеДокумента = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаОбъекты.Объект.Метаданные());
		
		Если ТипЗнч(ВыборкаОбъекты.Объект) = Тип("СправочникСсылка.CW_Заказы") Тогда
			ПредставлениеОбъекта = "Заказ №"+Строка(ВыборкаОбъекты.Объект);
		ИначеЕсли ЕстьРеквизитПредставлениеДокумента Тогда
			ПредставлениеОбъекта = Строка(ВыборкаОбъекты.Объект.ПредставлениеДокумента);
		Иначе
			ПредставлениеОбъекта = Строка(ВыборкаОбъекты.Объект);
		КонецЕсли;
		
		ГруппаДереваОбъект = ГруппаДерева.Строки.Найти(ПредставлениеОбъекта, "Представление", Ложь);
		Если ГруппаДереваОбъект = Неопределено Тогда
			ГруппаДереваОбъект = ГруппаДерева.Строки.Добавить();
			ГруппаДереваОбъект.Группа 			= Истина;
			ГруппаДереваОбъект.Представление 	= ПредставлениеОбъекта;
			ГруппаДереваОбъект.ИндексКартинки 	= 2;
		КонецЕсли;
		
		Выборка = ВыборкаОбъекты.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаДерева = ГруппаДереваОбъект.Строки.Добавить();
			
			СтрокаДерева.Группа = Ложь;
			СтрокаДерева.Представление = Строка(Выборка.Файл);
			СтрокаДерева.Ссылка = Выборка.Файл;
			
			СтрокаДерева.ИндексКартинки = Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(Выборка.Расширение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(тДеревоФайлов,"ДеревоФайлов");
		
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивВладельцевАрхива()
	
	массивВладельцевАрхива = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЗНАЧЕНИЕ(Справочник.CW_Грузоперевозки.ПустаяСсылка) КАК ВладелецАрхива ПОМЕСТИТЬ ВТ_ОбъектыАрхива ГДЕ ЛОЖЬ"; // на случай если тип не пердусмотрен
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		массивВладельцевАрхива.Добавить(ДанныеДляЗаполненияШаблона);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК ВладелецАрхива
		|ПОМЕСТИТЬ ВТ_ОбъектыАрхива
		|ИЗ
		|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДанныеДляЗаполненияШаблона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ
		|ИЗ
		|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДанныеДляЗаполненияШаблона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов
		|ИЗ
		|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДанныеДляЗаполненияШаблона";
		
		Запрос.УстановитьПараметр("ДанныеДляЗаполненияШаблона", ДанныеДляЗаполненияШаблона);
		Запрос.Выполнить();
		
	ИначеЕсли ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		МассивСвязанныхДокументов =	ПолучитьМассивСвязанныхДокументов();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(массивВладельцевАрхива, МассивСвязанныхДокументов, истина);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК ВладелецАрхива
		|ПОМЕСТИТЬ ВТ_ОбъектыАрхива
		|ИЗ
		|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В (&МассивСвязанныхДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ
		|ИЗ
		|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В (&МассивСвязанныхДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов
		|ИЗ
		|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В (&МассивСвязанныхДокументов)";
		
		Запрос.УстановитьПараметр("МассивСвязанныхДокументов", МассивСвязанныхДокументов);
		Запрос.Выполнить();
		
	ИначеЕсли ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		массивВладельцевАрхива.Добавить(ДанныеДляЗаполненияШаблона);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка КАК ВладелецАрхива
		|ПОМЕСТИТЬ ВТ_ОбъектыАрхива
		|ИЗ
		|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &ДанныеДляЗаполненияШаблона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ
		|ИЗ
		|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
		|ГДЕ
		|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &ДанныеДляЗаполненияШаблона";
		
		Запрос.УстановитьПараметр("ДанныеДляЗаполненияШаблона", ДанныеДляЗаполненияШаблона);
		Запрос.Выполнить();
		
	ИначеЕсли ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("СправочникСсылка.CW_Заказы") Тогда
		массивВладельцевАрхива.Добавить(ДанныеДляЗаполненияШаблона);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ спр.Ссылка КАК ВладелецАрхива ПОМЕСТИТЬ ВТ_ОбъектыАрхива ИЗ Справочник.CW_Грузоперевозки как спр ГДЕ Заказ=&ДанныеДляЗаполненияШаблона";
		Запрос.УстановитьПараметр("ДанныеДляЗаполненияШаблона", ДанныеДляЗаполненияШаблона);
		Запрос.Выполнить();
		
	ИначеЕсли ТипЗнч(ДанныеДляЗаполненияШаблона) = Тип("СправочникСсылка.CW_Заявки") Тогда
		массивВладельцевАрхива.Добавить(ДанныеДляЗаполненияШаблона);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ спр.Ссылка КАК ВладелецАрхива ПОМЕСТИТЬ ВТ_ОбъектыАрхива ИЗ Справочник.CW_Грузоперевозки как спр ГДЕ Заявка=&ДанныеДляЗаполненияШаблона";
		Запрос.УстановитьПараметр("ДанныеДляЗаполненияШаблона", ДанныеДляЗаполненияШаблона);
		Запрос.Выполнить();
		
	Иначе
		// собственно Справочник.CW_Грузоперевозки, а также любые другие типы объектов, которые не поддерживаются 
		// текст запроса по умолчанию уже задан
		массивВладельцевАрхива.Добавить(ДанныеДляЗаполненияШаблона);
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ОбъектыАрхива.ВладелецАрхива КАК ВладелецАрхива
	|ИЗ
	|	ВТ_ОбъектыАрхива КАК ВТ_ОбъектыАрхива
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОбъектыАрхива.ВладелецАрхива";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		массивВладельцевАрхива.Добавить(Выборка.ВладелецАрхива);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ШаблоныСтандартныхПисем.Ссылка
		|ИЗ
		|	Справочник.CW_ШаблоныСтандартныхПисем КАК CW_ШаблоныСтандартныхПисем
		|ГДЕ
		|	CW_ШаблоныСтандартныхПисем.Ссылка = &Шаблон";
		Запрос.УстановитьПараметр("Шаблон", 		Шаблон);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			массивВладельцевАрхива.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат массивВладельцевАрхива;

КонецФункции
 

&НаСервере
Функция СформироватьПисьмо(СтруктураПолучателей)
	
	НастройкиПользователя 	= CW_Настройки.ПолучитьНастройкиПользователя();

	СтруктураПисьма = _ЭП.СтруктураПисьма();
	
	СтруктураПисьма.Отправитель = НастройкиПользователя.УчетнаяЗаписьЭлектроннойПочты;
	
	Если (ДанныеДляЗаполненияШаблона <> Неопределено И ЗначениеЗаполнено(Шаблон)) Тогда
		СтруктураПисьма.Тема	= ОбработатьМакросыТекста(Шаблон.Тема, НастройкиПользователя);
		Тело 					= ОбработатьМакросыТекста(Шаблон.ТелоHTML, НастройкиПользователя);
		
		_ЭП.ДобавитьТекст(СтруктураПисьма,Тело);
		
		Для каждого СтрВложения Из Шаблон.Вложения Цикл
			Картинка = СтрВложения.ДанныеФайла.Получить();
			_ЭП.ДобавитьВложение(СтруктураПисьма,СтрВложения.Имя,"Адрес", Картинка, СтрВложения.Имя);
		КонецЦикла; 
		
	КонецЕсли; 
	
	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели, 				СтруктураПолучателей.Кому);
	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_Копии, 			СтруктураПолучателей.Копия);
	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_СкрытыеКопии,	СтруктураПолучателей.СкрытаяКопия);
	
	//Получители из щаблона
	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели,				Шаблон.Кому);
	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_Копии,		Шаблон.Копия);
	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_СкрытыеКопии,Шаблон.СкрытаяКопия);
	//Получители из щаблона
	
	Если НастройкиПользователя.СкрытаяКопияСебе Тогда
		_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_СкрытыеКопии, НастройкиПользователя.УчетнаяЗаписьЭлектроннойПочты.ПочтовыйАдрес);
	КонецЕсли;

	//Печатные формы
	СтруктураОтбора 	= Новый Структура("Отправлять", Истина);
	мСтрокиПечатныхФорм = Формы.НайтиСтроки(СтруктураОтбора);
	
	Если Не ОтправитьОднимФайлом Тогда //Каждую ПФ сохраням в файл
		Для каждого СтрокаПечатныхФорм Из мСтрокиПечатныхФорм Цикл
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("PDF");
			
			ТабДок = ПолучитьИзВременногоХранилища(СтрокаПечатныхФорм.Адрес);
			ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			ДвоичныеДанные 	= Новый ДвоичныеДанные(ИмяВременногоФайла);
			АдресФайла 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			
			_ЭП.ДобавитьВложение(СтруктураПисьма,СтрокаПечатныхФорм.Имя+".pdf","адрес",АдресФайла);
			
		КонецЦикла;
	Иначе
		
		ИмяФайлаДокументов = ?(ПустаяСтрока(ИмяФайлаПакета), "Пакет документов", ИмяФайлаПакета);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("PDF");
	
		Пакет = Новый ПакетОтображаемыхДокументов;
		
		Для каждого СтрокаПечатныхФорм Из мСтрокиПечатныхФорм Цикл
			ТабДок = ПолучитьИзВременногоХранилища(СтрокаПечатныхФорм.Адрес);
			ЭлементПакета = Пакет.Состав.Добавить();
			ЭлементПакета.Данные 		= ПоместитьВоВременноеХранилище(ТабДок, Новый УникальныйИдентификатор);
			ЭлементПакета.Наименование 	= СтрокаПечатныхФорм.Имя;
		КонецЦикла;
		
		Попытка
			Пакет.Записать(ИмяВременногоФайла, ТипФайлаПакетаОтображаемыхДокументов.PDF);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = 	"Не удалось сохранить документы";
			Сообщение.Сообщить();
		КонецПопытки;
		
		ДвоичныеДанные 	= Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресФайла 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
		
		_ЭП.ДобавитьВложение(СтруктураПисьма, ИмяФайлаДокументов+".pdf", "адрес", АдресФайла);
	
	КонецЕсли;
	//---Печатные формы  
	
	//Документы по шаблонам 
	//Документы по шаблонам формируем в момент отправки
	СтруктураОтбора = Новый Структура("Отправлять", Истина);
	мСтрокиШаблонов = ШаблоныДокументов.НайтиСтроки(СтруктураОтбора);
	
	Для каждого СтрокаШаблонов Из мСтрокиШаблонов Цикл 
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("PDF");
		
		ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаШаблонов.Шаблон, "ХранилищеШаблона");  
		Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
			Макет = ХранилищеШаблона.Получить();
		КонецЕсли; 
		
		Если СтрокаШаблонов.Формат = "MXL" Тогда
			
			
			ПараметрыПроцедуры = Новый Структура;
			ПараметрыПроцедуры.Вставить("Макет", 		Макет); 
			ПараметрыПроцедуры.Вставить("ОбъектПечати",	ДанныеДляЗаполненияШаблона); 
			
			ТабличныйДокумент = CW_ШаблоныДокументовСерверВызовСервера.ЗаполнитьMXLДокументПоШаблону(ПараметрыПроцедуры);
			
			ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
		КонецЕсли;
		
		Если СтрокаШаблонов.Формат = "HTML" Тогда
			
			ПараметрыПроцедуры = Новый Структура;
			ПараметрыПроцедуры.Вставить("ОбъектПечати",		ДанныеДляЗаполненияШаблона);  
			ПараметрыПроцедуры.Вставить("ДанныеШаблона", 	Макет);     
			
			АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
			
			CW_ШаблоныДокументовСерверВызовСервера.ЗаполнитьФорматированныйДокументПоШаблону(ПараметрыПроцедуры, АдресРезультата); 
			
			ВремФорматированныйДокумент = ПолучитьИзВременногоХранилища(АдресРезультата); 
			
			Вложения 	= Новый Структура;
			ТекстHTML 	= ""; 
			ВремФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
			
			ФорматированныйДокумент = Новый ФорматированныйДокумент;
			ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения);  
			
			ПодготовитьPDFНаОсновеФорматированногоДокумента(ФорматированныйДокумент, ИмяВременногоФайла);
			
		КонецЕсли;
		
		ДвоичныеДанные 	= Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресФайла 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
		
		_ЭП.ДобавитьВложение(СтруктураПисьма,СокрЛП(СтрокаШаблонов.Шаблон)+".pdf","адрес", АдресФайла);
		
	КонецЦикла;
	//---Документы по шаблонам


	
	//Прикрепленные файлы
	ТДеревоФайлов = РеквизитФормыВЗначение("ДеревоФайлов");
	
	СтруктураОтбора = Новый Структура("Группа,Пометка", Ложь, Истина);
	мСтрокиФайлов = ТДеревоФайлов.Строки.НайтиСтроки(СтруктураОтбора, Истина);
	
	Для Каждого СтрокаФайлов из мСтрокиФайлов Цикл
		Если НЕ СтрокаФайлов.Пометка Тогда
			Продолжить;
		КонецЕсли;  
		
		ДанныеФайла = CW_РаботаСФайламиСервер.ДанныеФайла(СтрокаФайлов.Ссылка); 
		АдресФайла  = CW_РаботаСФайламиСервер.ПолучитьСсылкуНаДвоичныеДанные(СтрокаФайлов.Ссылка);	
		
		_ЭП.ДобавитьВложение(СтруктураПисьма, ДанныеФайла.ИмяФайла,"адрес", АдресФайла);
		
	КонецЦикла;
	//---Прикрепленные файлы
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураПисьма,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура  ПодготовитьPDFНаОсновеФорматированногоДокумента(ФорматированныйДокумент, ИмяВременногоФайла)
	
	ТекстHTML = "";
	Вложения = Новый Структура();
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	// Т.к. PDF является нередактируемым, то чтобы при печати не было избыточных выделений,
	// снимем желтый цвет с параметров шаблона, который раньше сами устанавливали.
	// Форматирование, сделанное пользователем, не меняем.
	// Выполняем это во вспомогательном форматированном документе.
	ВспомогательныйФорматированныйДокумент = Новый ФорматированныйДокумент();
	ВспомогательныйФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения);
	
	ЦветФонаПоУмолчанию = ПечатьДоговоровКлиентСервер.ЦветФонаПоУмолчанию();
	
	Для каждого Параграф Из ВспомогательныйФорматированныйДокумент.Элементы Цикл
	
		Для каждого ЭлементДокумента Из Параграф.Элементы Цикл
		
			Если ТипЗнч(ЭлементДокумента) <> Тип("ТекстФорматированногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
			
			//Если ЭлементДокумента.ЦветФона = ЦветФонаЗаменяемогоПараметра Тогда
			//	ЭлементДокумента.ЦветФона = ЦветФонаПоУмолчанию;
			//КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	ВспомогательныйФорматированныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаФорматированногоДокумента.PDF);
	
КонецПроцедуры


&НаСервере
Функция ОбработатьМакросыТекста(Знач ШаблонТекста, НастройкиПользователя)

	Источник = ДанныеДляЗаполненияШаблона;
	
	//ДанныеФизическогоЛица
	ДанныеФизическогоЛица = ПолучитьДанныеФизическогоЛица(НастройкиПользователя);
	//--ДанныеФизическогоЛица

	ИдентификаторОбъектаМетаданных 	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник));
	МенеджерОбъектаШаблона = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ИдентификаторОбъектаМетаданных.ЗначениеПустойСсылки); 
	
	Попытка   
		//Метода может и не быть
		ДополнительныеПараметры = МенеджерОбъектаШаблона.ПараметрыОписанияМакросов(Источник);
	Исключение
	КонецПопытки;
	
	ОписаниеМакросов = Справочники.CW_ШаблоныСтандартныхПисем.ПолучитьОписаниеМакросов(ИдентификаторОбъектаМетаданных, ДополнительныеПараметры); 
	СоответствиеПараметров 	= ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСоответствиеПараметров(); 
	
	Текст 		= ШаблонТекста;
	мМакросы 	= ПолучитьМакросыПисьма(ШаблонТекста);
	
	Для Каждого Макрос из мМакросы Цикл
		Формула = ОписаниеМакросов.Получить(Макрос);
		
		Попытка
			ЗначениеФункции = Вычислить(Формула);
		Исключение
			ЗначениеФункции = "";
		КонецПопытки;
				 
		Если Строка(ТипЗнч(ЗначениеФункции)) = Строка(Тип("Дата")) Тогда
			ЗначениеФункции = Формат(ЗначениеФункции, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Текст = СтрЗаменить(Текст, Макрос, ЗначениеФункции); 
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеФизическогоЛица(Знач НастройкиПользователя)
	
	Если ЗначениеЗаполнено(НастройкиПользователя.Пользователь.ФизическоеЛицо) Тогда
		//подучим данные физического лица
		ДанныеФизическогоЛица = ФизическиеЛицаЗарплатаКадры.ДанныеФизическогоЛицаДляРегламентированнойОтчетности(НастройкиПользователя.Пользователь.ФизическоеЛицо,,ТекущаяДата()); // ВызовБП
	Иначе
		//Физ. лицо в пользователе не заполнено, разберем стоку ФИО, 
		мДанныеФизическогоЛица = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НастройкиПользователя.ФИО," ");
		
		ДанныеФизическогоЛица = Новый Структура("Фамилия,Имя,Отчество",Неопределено,Неопределено,Неопределено);
		
		Если мДанныеФизическогоЛица.Количество()>0 Тогда
			ДанныеФизическогоЛица.Фамилия = мДанныеФизическогоЛица[0];	
		КонецЕсли;
		Если мДанныеФизическогоЛица.Количество()>1 Тогда
			ДанныеФизическогоЛица.Имя = мДанныеФизическогоЛица[1];	
		КонецЕсли;
		Если мДанныеФизическогоЛица.Количество()>2 Тогда
			ДанныеФизическогоЛица.Отчество = мДанныеФизическогоЛица[2];	
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ДанныеФизическогоЛица;

КонецФункции

&НаСервере
Функция ПолучитьМакросыПисьма(ТекстШаблона) 
	
	Результат = Новый Массив;
	
	ДеревоМакросов = Справочники.CW_ШаблоныСтандартныхПисем.ПолучитьСписокДоступныхМакросов(Шаблон.ОбъектШаблона);
	
	ОтборСтрок = Новый Структура("ЭтоГруппа", Ложь);
	НайденныеСтроки = ДеревоМакросов.Строки.НайтиСтроки(ОтборСтрок, Истина);
	
	Для Каждого СтрокаДерева из НайденныеСтроки Цикл
		Если СтрНайти(ТекстШаблона,СтрокаДерева.Значение) > 0 Тогда
			Результат.Добавить(СтрокаДерева.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект)
	ВидТелефона = Справочники.ВидыКонтактнойИнформации["ТелефонСлужебныйФизЛица"];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид"   , ВидТелефона);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И
	|	КонтактнаяИнформация.Тип = &Тип
	|	И
	|	КонтактнаяИнформация.Вид = &Вид
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;

КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

&НаСервереБезКонтекста
Функция ПолучитьЕмэйлИзКонтактнойИнформации(Объект)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации["EmailФизЛица"]);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И
	|	КонтактнаяИнформация.Тип = &Тип
	|	И
	|	КонтактнаяИнформация.Вид = &Вид
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;

КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

&НаСервереБезКонтекста
Функция ФамилияИОИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество) Экспорт 
	// Преобразует строку вида " Пупкин Василий Иванович" в "Пупкин В.И."
	
	стр = СокрЛП(строкаФамилияИмяОтчество);
	
	// удалим двойные пробелы
	Пока Найти(стр, "  ")>0 Цикл
		стр = СтрЗаменить(стр, "  ", " ");
	КонецЦикла;
	
	// разделим на [три] строки
	стр = СтрЗаменить(стр, " ", Символы.ПС);
	
	Фамилия  = СтрПолучитьСтроку(стр, 1);
	Имя      = "";
	Отчество = "";
	
	Если СтрЧислоСтрок(стр) >= 2 Тогда 
		Имя = СтрПолучитьСтроку(стр, 2);
	КонецЕсли;
	
	Если СтрЧислоСтрок(стр) >= 3 Тогда 
		Отчество = СтрПолучитьСтроку(стр, 3);
	КонецЕсли;
	
	ФамилияИО = ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + 
				?(НЕ ПустаяСтрока(Отчество) , 
				Лев(Отчество,1)+".", ""), ""), "");
	
	Возврат ФамилияИО;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьОднимФайломПриИзменении(Элемент)
	
	Элементы.ГруппаИмяФайлаПакета.Видимость = ОтправитьОднимФайлом;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПечатныеФормы(Команда)
	СнятьУстановитьВсеПечатныеФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПечатныеФормы(Команда)
	СнятьУстановитьВсеПечатныеФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьУстановитьВсеПечатныеФормы(Флаг)
	
	Для Каждого СтрокаФорм из Формы Цикл
		СтрокаФорм.Отправлять = Флаг;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФайлы(Команда)
	
	СнятьВУстановитьВсеФайлыНаСервере(Ложь);
	РазвернутьВсеСтрокиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФайлы(Команда)
	
	СнятьВУстановитьВсеФайлыНаСервере(Истина); 
	РазвернутьВсеСтрокиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеСтрокиДерева()
	
	ЭлементыДерева = ДеревоФайлов.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() > 0 Тогда
		ИдентификаторСтроки = ЭлементыДерева[0].ПолучитьИдентификатор();
		Элементы.ДеревоФайлов.Развернуть(ИдентификаторСтроки, Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СнятьВУстановитьВсеФайлыНаСервере(Флаг)
	
	ТДерево = РеквизитФормыВЗначение("ДеревоФайлов");
	
	ПараметрыОтбора = Новый Структура("Группа", Ложь);
	мСтроки = ТДерево.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	
	Для Каждого СтрокаДерева из мСтроки Цикл
		СтрокаДерева.Пометка = Флаг;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТДерево, "ДеревоФайлов");
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВсеШаблоны(Команда)
	СнятьУстановитьВсеШаблоны(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеШаблоны(Команда)
	СнятьУстановитьВсеШаблоны(Ложь);
КонецПроцедуры

 &НаКлиенте
Процедура СнятьУстановитьВсеШаблоны(Флаг)
	
	Для Каждого СтрокаШаблонов из ШаблоныДокументов Цикл
		СтрокаШаблонов.Отправлять = Флаг;
	КонецЦикла;
	
КонецПроцедуры
